blog.org
#+TITLE: Blog


#+hugo_base_dir: .
#+hugo_section: post
#+export_hugo_section: post
#+hugo_auto_set_lastmod: t

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval never-export
#
#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@
#+macro: youtube @@html:<div class="org-youtube"><iframe src="https://www.youtube-nocookie.com/embed/$1" allowfullscreen title="YouTube Video"></iframe></div>@@






#+author:
** Org-Mode Formatting and General
:PROPERTIES:
:EXPORT_DATE: 2017-07-31
:EXPORT_FILE_NAME: general-formatting
:END:
*** Markup - Org vs Markdown
Below table shows the translation of Org markup to Markdown markup in
the exported =.md= files.
|--------------------+--------------------------------------------------------------------+-----------------------|
| Org                | Markdown                                                           | In Hugo rendered HTML |
|--------------------+--------------------------------------------------------------------+-----------------------|
| =*bold*=           | =**bold**=                                                         | *bold*                |
| =/italics/=        | =_italics_=                                                        | /italics/             |
| ==monospace==      | =`monospace`=                                                      | =monospace=           |
| =~key-binding~=    | =`key-binding`=                                                    | ~key-binding~         |
|                    | - if =org-hugo-use-code-for-kbd= is nil [default]                  |                       |
| =~key-binding~=    | =<kbd>key-binding</kbd>=                                           |                       |
|                    | - if =org-hugo-use-code-for-kbd= is non-nil                        |                       |
|                    | - Requires *CSS* to render the =<kbd>= tag as something special.   |                       |
| =+strike-through+= | =~~strike-through~~=                                               | +strike-through+      |
| =_underline_=      | =<span class = "underline">underline</span>=                       | _underline_           |
|                    | - Requires *CSS* to render this =underline= class as an underline. |                       |
|--------------------+--------------------------------------------------------------------+-----------------------|
*** Hyphens and spaces in categories :@an_apple__a___pear:@good__bad__and__ugly:an_apple__a___pear:
:PROPERTIES:
:EXPORT_FILE_NAME: hyphens-and-spaces-in-categories
:END:
The Org tags do not allow spaces. So the trick we use is replace
- *single* underscore becomes a -
  In Org =@abc_def= becomes Hugo category =abc-def=

- *double* underscores becomes a spaces.
  An Org tag =@abc__def= becomes Hugo category =abc def=

- *triple* underscore becomes a _
  An Org tag =@arb___def= becomes Hugo category =abc_def=
**** Prefer Hyphen Categories :@_a:@___a:@b_:@b___:@a_b:@a___b:@a_b___c:@_a_b___c___:
*** Tags - Ensure that certain sections does not become exported
By placing your cursor on a heading, press =C-c, C-c= you will assign tags


Tags allows one to assign groupings of the files by writing =:some-tag-name:=
One can also assign tags at the heading of an article with =:@top-tag:=
You can also ensure that certain headings wont be exported by adding the tag: =:noexport:=
*** Add comments
#+begin_src org
,#+begin_description
Test the case where the title contains only the date, making it look
like a Hugo TOML date field.
,#+end_description
#+end_src
*** Math
Math can be displayed in many ways, either centered directly with =$$ $$= or with LaTeX source blocks:
**** TODO
$$x \forall \mathcal{X} \in \{1, 2, \cdots, n\}$$
$$\sum_{i=1}^{Q}w_i^2$$
*** Code
#+begin_src python
class GP(gp.models.ExactGP):
    def __init__(self, cov, train_x, train_y):
        super(GP, self).__init__(train_x, train_y, GaussianLikelihood())
        self.mean = gp.means.ConstantMean()
        self.cov = cov

    def forward(self, x):
        return MultivariateNormal(self.mean(x), self.cov(x))

    def predict(self, x):
        """Returns the posterior mean together with
        the boundaries for the 95% credible intervals.
        """
        self.eval()
        with torch.no_grad():
            pred = self.likelihood(self(x))
            lower, upper = pred.confidence_region()

        return pred.mean, lower, upper

    def spectral_density(self, smk) -> MixtureSameFamily:
        """Returns the Mixture of Gaussians over the spectral density
        of the provided spectral mixture kernel."""
        mus = smk.mixture_means.detach().reshape(-1, 1)
        sigmas = smk.mixture_scales.detach().reshape(-1, 1)
        mix = Categorical(smk.mixture_weights.detach())
        comp = Independent(Normal(mus, sigmas), 1)
        return MixtureSameFamily(mix, comp)
#+end_src
*** Use Org Code markup for =kbd= tag (default behavior)
This is the default behavior. So =~C-h f~= will show up as =`C-h f`=
and then =<code>C-h f</code>= in the final Hugo generated HTML.

Example:
- Few of Emacs help keybindings: ~C-h f~, ~C-h v~
*** Example blocks with line number annotation
- [[https://orgmode.org/manual/Literal-examples.html][Org reference]]
- [[https://gohugo.io/content-management/syntax-highlighting/][Hugo =highlight= shortcode with line numbers]]
**** Default new line number start
#+begin_example -n
line 1
 line 2
#+end_example
*** Wrapping Org headings in HTML tags :wrapping:headings:section:tags:HTML:
#+begin_description
Test the workaround for wrapping Org headings in HTML tags like
~section~ and ~div~.
#+end_description
{{{oxhugoissue(160)}}}
